# IdeaStatiCa.RcsApi.Model.AnchorGrid
Data of the anchor grid

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**ShearInThread** | **bool** | Indicates, whether a shear plane is in the thread of a bolt. | [optional]
**ConcreteBlock** | **ConcreteBlock** |  | [optional]
**AnchorType** | **AnchorType** |  | [optional]
**WasherSize** | **double** | Washer Size used if AnchorType is washer | [optional]
**AnchoringLength** | **double** | Anchoring Length | [optional]
**HookLength** | **double** | Length of anchor hook&lt;br /&gt;  (distance from the inner surface of the anchor shaft to the outer tip of the hook specified as an anchor diameter multiplier) | [optional]
**BoltAssembly** | **ReferenceElement** |  | [optional]
**Origin** | **Point3D** |  | [optional]
**AxisX** | **Vector3D** |  | [optional]
**AxisY** | **Vector3D** |  | [optional]
**AxisZ** | **Vector3D** |  | [optional]
**Positions** | **List&lt;Point3D&gt;** | Positions of holes in the local coordinate system of the grid | [optional]
**ConnectedParts** | **List&lt;ReferenceElement&gt;** | List of the connected parts | [optional]
**Name** | **string** | Name | [optional]
**Length** | **double** | Length | [optional]
**Id** | **int** | Element Id | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)